artlaman.chalice-icon-theme@1.2.24
ecmel.vscode-html-css@2.0.13
matepek.vscode-catch2-test-adapter@4.12.2
ms-python.black-formatter@2024.4.0
ms-python.debugpy@2024.14.0
ms-python.python@2024.22.2
ms-python.vscode-pylance@2024.12.1
ms-toolsai.jupyter@2024.10.0
ms-toolsai.jupyter-keymap@1.1.2
ms-toolsai.jupyter-renderers@1.0.21
ms-toolsai.vscode-jupyter-cell-tags@0.1.9
ms-toolsai.vscode-jupyter-slideshow@0.1.6
ms-vscode.cmake-tools@1.19.52
ms-vscode.cpptools@1.22.11
ms-vscode.cpptools-extension-pack@1.3.0
ms-vscode.makefile-tools@0.11.13
platformio.platformio-ide@3.3.4
rust-lang.rust-analyzer@0.3.2273
saoudrizwan.claude-dev@3.2.5
slevesque.shader@1.1.5
tomoki1207.pdf@1.2.2
twxs.cmake@0.0.17
vitchu.vscode-autohide-vim@1.0.7
vscodevim.vim@1.29.0
zignd.html-css-class-completion@1.20.0
