artlaman.chalice-icon-theme@1.2.24
matepek.vscode-catch2-test-adapter@4.8.0
ms-python.black-formatter@2023.6.0
ms-python.python@2023.22.1
ms-python.vscode-pylance@2023.12.1
ms-vscode.cmake-tools@1.16.32
ms-vscode.cpptools@1.18.5
ms-vscode.cpptools-extension-pack@1.3.0
ms-vscode.makefile-tools@0.8.22
platformio.platformio-ide@3.3.3
rust-lang.rust-analyzer@0.3.1815
slevesque.shader@1.1.5
tomoki1207.pdf@1.2.2
twxs.cmake@0.0.17
Vitchu.vscode-autohide-vim@1.0.7
vscodevim.vim@1.27.2
